# 4.5 IC Data Consistency Checks

## Content


1. **Importing Libraries**
2. **Importing Data Sets**
3. **Data Consistency Checks**  
   3.1 Mixed-type Data  
   3.2 Missing Values  
   3.3 Duplicates  
   3.4 Exporting Data Frame    
5. **Task on df_ords**  
   4.1 Descriptive Statistics Check  
             *4.1.1 Fixing Unnamed Column*  
             *4.1.2 Back to Task*  
   4.2 Mixed-type Data  
   4.3 Missing Values  
   4.4 Duplicate Values  
   4.5 Export cleaned Data Set

## 1. Importing Libraries

In [1]:
# Import libraries
import pandas as pd
import numpy as np
import os

## 2. Importing Data Sets

In [2]:
# Creating the shortcut
path = r'/home/justem/CF - Data Analyst/Achievement 4/02-2025 Instacart Basket Analysis'

In [3]:
# Importing data set products
df_prods = pd.read_csv(os.path.join(path, '02 Data', 'Original Data', 'products.csv'), index_col = False)

In [4]:
# Importing data set orders
df_ords = pd.read_csv(os.path.join(path, '02 Data', 'Prepared Data', 'orders_wrangled.csv'), index_col = False)

## 3. Data Consistency Checks

### 3.1 Mixed-type Data

In [5]:
# Creatig a dataframe
df_test = pd.DataFrame()

In [6]:
# Creating a mixed type column
df_test['mix'] = ['a', 'b', 1, True]

In [7]:
df_test.head()

    mix
0     a
1     b
2     1
3  True

In [8]:
# Check for mixed types

for col in df_test.columns.tolist():
    weird = (df_test[[col]].applymap(type) != df_test[[col]].iloc[0].apply(type)).any(axis = 1)
    if len (df_test[weird]) > 0:
        print(col)

mix

/tmp/ipykernel_14520/4062208833.py:4: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.
  weird = (df_test[[col]].applymap(type) != df_test[[col]].iloc[0].apply(type)).any(axis = 1)

In [9]:
# Converting numeric data into string
df_test['mix'] = df_test['mix'].astype('str')

In [10]:
# Checking data type
df_test['mix'].dtype

dtype('O')

In [11]:
# 'O' stand for object - string

In [12]:
# Check for mixed types - updated code version
df_converted = df_test.infer_objects()
mixed_types = [col for col in df_converted.columns if df_converted[col].map(type).nunique() > 1]
print("Colums with mixed data types:", mixed_types)

Colums with mixed data types: []

In [13]:
# Checking data type of new df
df_converted['mix'].dtype

dtype('O')

### 3.2 Missing Values

In [14]:
# Finding missing values
df_prods.isnull().sum()

product_id        0
product_name     16
aisle_id          0
department_id     0
prices            0
dtype: int64

In [15]:
# Viewing missing values
df_nan = df_prods[df_prods['product_name'].isnull() == True]

In [16]:
df_nan

       product_id product_name  aisle_id  department_id  prices
33             34          NaN       121             14    12.2
68             69          NaN        26              7    11.8
115           116          NaN        93              3    10.8
261           262          NaN       110             13    12.1
525           525          NaN       109             11     1.2
1511         1511          NaN        84             16    14.3
1780         1780          NaN       126             11    12.3
2240         2240          NaN        52              1    14.2
2586         2586          NaN       104             13    12.4
3159         3159          NaN       126             11    13.1
3230         3230          NaN       120             16    14.4
3736         3736          NaN        41              8    14.8
4283         4283          NaN        77              7    14.4
4790         4790          NaN        91             16    14.5
38187       38183          NaN        39             12    20.9
40444       40440          NaN       120             16    14.8

In [17]:
# Alternative way
df_nan_alt = df_prods[df_prods['product_name'].isnull()]

In [18]:
df_nan_alt

       product_id product_name  aisle_id  department_id  prices
33             34          NaN       121             14    12.2
68             69          NaN        26              7    11.8
115           116          NaN        93              3    10.8
261           262          NaN       110             13    12.1
525           525          NaN       109             11     1.2
1511         1511          NaN        84             16    14.3
1780         1780          NaN       126             11    12.3
2240         2240          NaN        52              1    14.2
2586         2586          NaN       104             13    12.4
3159         3159          NaN       126             11    13.1
3230         3230          NaN       120             16    14.4
3736         3736          NaN        41              8    14.8
4283         4283          NaN        77              7    14.4
4790         4790          NaN        91             16    14.5
38187       38183          NaN        39             12    20.9
40444       40440          NaN       120             16    14.8

In [19]:
# Checking for number of rows to compare them later
df_prods.shape

(49693, 5)

In [20]:
# Creating new dataframe without missing values
df_prods_clean = df_prods[df_prods['product_name'].isnull() == False]

In [21]:
# Checking new dataframe
df_prods_clean.shape

(49677, 5)

### 3.3 Duplicates

In [22]:
# Locating duplicates
df_dups = df_prods_clean[df_prods_clean.duplicated()]

In [23]:
df_dups

,product_id,product_name,aisle_id,department_id,prices
462,462,Fiber 4g Gummy Dietary Supplement,70,11,4.8
18459,18458,Ranger IPA,27,5,9.2
26810,26808,Black House Coffee Roasty Stout Beer,27,5,13.4
35309,35306,Gluten Free Organic Peanut Butter & Chocolate ...,121,14,6.8
35495,35491,Adore Forever Body Wash,127,11,9.9

In [24]:
# Checking number of rows
df_prods_clean.shape

(49677, 5)

In [25]:
# Create new dataframe without duplicates
df_prods_clean_no_dups = df_prods_clean.drop_duplicates()

In [26]:
# Checking number of rows again
df_prods_clean_no_dups.shape

(49672, 5)

### 3.4 Exporting Data Frame

In [27]:
df_prods_clean_no_dups.to_csv(os.path.join(path, '02 Data', 'Prepared Data', 'prods_cons_checked.csv'))

In [41]:
df_prods_clean_no_dups.to_csv(os.path.join(path, '02 Data', 'Prepared Data', 'prods_cons_checked.csv'))

## 4. Task on df_ords

### 4.1 Descriptive Statistics Check

In [42]:
# Running df describe on df.ords
df_ords.describe()

,Unnamed: 0,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,days_since_prior_order
count,3.421083e+06,3.421083e+06,3.421083e+06,3.421083e+06,3.421083e+06,3.421083e+06,3.214874e+06
mean,1.710541e+06,1.710542e+06,1.029782e+05,1.715486e+01,2.776219e+00,1.345202e+01,1.111484e+01
std,9.875817e+05,9.875817e+05,5.953372e+04,1.773316e+01,2.046829e+00,4.226088e+00,9.206737e+00
min,0.000000e+00,1.000000e+00,1.000000e+00,1.000000e+00,0.000000e+00,0.000000e+00,0.000000e+00
25%,8.552705e+05,8.552715e+05,5.139400e+04,5.000000e+00,1.000000e+00,1.000000e+01,4.000000e+00
50%,1.710541e+06,1.710542e+06,1.026890e+05,1.100000e+01,3.000000e+00,1.300000e+01,7.000000e+00
75%,2.565812e+06,2.565812e+06,1.543850e+05,2.300000e+01,5.000000e+00,1.600000e+01,1.500000e+01
max,3.421082e+06,3.421083e+06,2.062090e+05,1.000000e+02,6.000000e+00,2.300000e+01,3.000000e+01

#### 4.1.1 Fixing Unnamed Column

In [43]:
# Checking table for 'Unnamed' column
df_ords.head()

,Unnamed: 0,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,days_since_prior_order
0,0,2539329,1,1,2,8,NaN
1,1,2398795,1,2,3,7,15.0
2,2,473747,1,3,3,12,21.0
3,3,2254736,1,4,4,7,29.0
4,4,431534,1,5,4,15,28.0

In [44]:
# Dropping 'Unnamed' column
df_ords = df_ords.drop(columns = ['Unnamed: 0'])

In [45]:
df_ords.head()

,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,days_since_prior_order
0,2539329,1,1,2,8,NaN
1,2398795,1,2,3,7,15.0
2,473747,1,3,3,12,21.0
3,2254736,1,4,4,7,29.0
4,431534,1,5,4,15,28.0

In [46]:
# @Shubham - if you have any idea why I got an extra column with an index, would like to know

#### 4.1.2 Back to Task

In [47]:
# Descriptive statistics on df_ords
df_ords.describe()

,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,days_since_prior_order
count,3.421083e+06,3.421083e+06,3.421083e+06,3.421083e+06,3.421083e+06,3.214874e+06
mean,1.710542e+06,1.029782e+05,1.715486e+01,2.776219e+00,1.345202e+01,1.111484e+01
std,9.875817e+05,5.953372e+04,1.773316e+01,2.046829e+00,4.226088e+00,9.206737e+00
min,1.000000e+00,1.000000e+00,1.000000e+00,0.000000e+00,0.000000e+00,0.000000e+00
25%,8.552715e+05,5.139400e+04,5.000000e+00,1.000000e+00,1.000000e+01,4.000000e+00
50%,1.710542e+06,1.026890e+05,1.100000e+01,3.000000e+00,1.300000e+01,7.000000e+00
75%,2.565812e+06,1.543850e+05,2.300000e+01,5.000000e+00,1.600000e+01,1.500000e+01
max,3.421083e+06,2.062090e+05,1.000000e+02,6.000000e+00,2.300000e+01,3.000000e+01

In [48]:
# Fixing the display to not showing in scientific numbers because it feels confusing to me

import pandas as pd

# Set pandas display option to not use scientific notation
pd.set_option('display.float_format', '{:.2f}'.format)

In [49]:
df_ords.describe()

,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,days_since_prior_order
count,3421083.00,3421083.00,3421083.00,3421083.00,3421083.00,3214874.00
mean,1710542.00,102978.21,17.15,2.78,13.45,11.11
std,987581.74,59533.72,17.73,2.05,4.23,9.21
min,1.00,1.00,1.00,0.00,0.00,0.00
25%,855271.50,51394.00,5.00,1.00,10.00,4.00
50%,1710542.00,102689.00,11.00,3.00,13.00,7.00
75%,2565812.50,154385.00,23.00,5.00,16.00,15.00
max,3421083.00,206209.00,100.00,6.00,23.00,30.00

It all looks very orderly to me.
The max for order number feels a bit confusing but I don't think I can check why it is like that. And it does not seem important for the achievement. I was confused about the use of "0" in orders_day_of_week and order_hours_of_day but this seems to be Sunday and a 24-hour format.

### 4.2 Mixed-type Data

In [50]:
# Checking for mixed-type data and converting the data type
df_ords_conv = df_ords.infer_objects()
mixed_types = [col for col in df_ords_conv.columns if df_ords_conv[col].map(type).nunique() > 1]
print("Colums with mixed data types:", mixed_types)

Colums with mixed data types: []

There are no mixed-type data in any columns

### 4.3 Missing Values

In [51]:
# Checking for missing values
df_ords.isnull().sum()

order_id                       0
user_id                        0
order_number                   0
orders_day_of_week             0
order_hour_of_day              0
days_since_prior_order    206209
dtype: int64

In [52]:
# Viewing missing values
df_mv = df_ords[df_ords['days_since_prior_order'].isnull() == True]

In [53]:
df_mv.head()

,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,days_since_prior_order
0,2539329,1,1,2,8,NaN
11,2168274,2,1,2,11,NaN
26,1374495,3,1,1,14,NaN
39,3343014,4,1,6,11,NaN
45,2717275,5,1,3,12,NaN

There are a lot of missing values for the column "days_since_prior_order" - but they could be a result of just new customers not having any prior orders. 
I would ask the senior or in the company if that is true and if it is, they could be replaced with a "0". 
Apparently there are as many missing values as users, so it will be the case that this values are just for new customers.

In [54]:
# In a new dataframe I will change those to "0"
df_ords_filled = df_ords.copy()
df_ords_filled['days_since_prior_order'] = df_ords_filled['days_since_prior_order'].fillna(0)

In [55]:
# Checking for missing values again
df_ords_filled.isnull().sum()

order_id                  0
user_id                   0
order_number              0
orders_day_of_week        0
order_hour_of_day         0
days_since_prior_order    0
dtype: int64

### 4.4 Duplicate Values

In [56]:
# Locating duplicates
df_ords_dups = df_ords_filled[df_ords_filled.duplicated()]

In [57]:
df_ords_dups

Empty DataFrame
Columns: [order_id, user_id, order_number, orders_day_of_week, order_hour_of_day, days_since_prior_order]
Index: []

There are no duplicates in the df_ords dataframe

### 4.5 Export cleaned Data Set

In [58]:
df_ords_filled.to_csv(os.path.join(path, '02 Data', 'Prepared Data', 'ords_cons_checked.csv'))